blog/app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 16]]
---

			<% @article.comments.each do |comment| %>