blog/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "134"], ["text", "1234"], ["created_at", "2023-10-03 10:41:54.099444"], ["updated_at", "2023-10-03 10:41:54.099444"]]
---
  def create
#    render plain: params[:article].inspect
    @article = Article.new article_params

    if @article.valid?
      @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?
---
  def update
    article = Article.find(params[:id])
    article.update article_params
    article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 17]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?
---
  def destroy
    article = Article.find(params[:id])
    article.delete
    article.save