blog/app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @article.comments.create(comments_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
INSERT INTO "comments" ("author", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "me"], ["body", "me leaved the comment <3"], ["article_id", 16], ["created_at", "2023-10-03 15:02:27.756149"], ["updated_at", "2023-10-03 15:02:27.756149"]]