blog/app/controllers/contacts_controller.rb

  def create
    #render plain: params[:contact].inspect
    @contact = Contact.new(contact_params)

    if @contact.valid?
      @contact.save
---
INSERT INTO "contacts" ("name", "phone", "email", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "asdf"], ["phone", "111"], ["email", "temp@mail.com"], ["message", "asdfad"], ["created_at", "2023-10-19 15:32:31.817653"], ["updated_at", "2023-10-19 15:32:31.817653"]]